# Шаталин Александр Андреевич
## Рабочая тетрадь 2

### 1.3.1 Задание

In [14]:
import numpy as np

arr = np.zeros(64).reshape(8, 8)

for i in range(8):
    for j in range(8):
        if (i + j) % 2 == 1:
            arr[i][j] = 1
        
print(arr)

[[0. 1. 0. 1. 0. 1. 0. 1.]
 [1. 0. 1. 0. 1. 0. 1. 0.]
 [0. 1. 0. 1. 0. 1. 0. 1.]
 [1. 0. 1. 0. 1. 0. 1. 0.]
 [0. 1. 0. 1. 0. 1. 0. 1.]
 [1. 0. 1. 0. 1. 0. 1. 0.]
 [0. 1. 0. 1. 0. 1. 0. 1.]
 [1. 0. 1. 0. 1. 0. 1. 0.]]

### 1.3.2 Задание

In [15]:
arr = np.array([])
for n in range(5):
    arr = np.append(arr, np.arange(0, 5))
print(arr.reshape(5, 5))

[[0. 1. 2. 3. 4.]
 [0. 1. 2. 3. 4.]
 [0. 1. 2. 3. 4.]
 [0. 1. 2. 3. 4.]
 [0. 1. 2. 3. 4.]]

### 1.3.3 Задание

In [16]:
arr = np.random.random((3, 3, 3))
print(arr)

[[[0.56677352 0.18731829 0.32692796]
  [0.73650197 0.99833903 0.53150133]
  [0.9851313  0.41704826 0.60743562]]

 [[0.44249164 0.87665499 0.4970242 ]
  [0.69652757 0.05237954 0.44045127]
  [0.69814385 0.08493368 0.9793033 ]]

 [[0.48102599 0.45858414 0.98942415]
  [0.81078671 0.06120415 0.81815785]
  [0.36146584 0.18557565 0.13383354]]]

### 1.3.4 Задание

In [17]:
arr = np.zeros(64).reshape(8, 8)

for i in range(8):
    for j in range(8):
        if i == 0 or j == 0 or i == 7 or j == 7:
            arr[i][j] = 1
            
print(arr)

[[1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 1.]
 [1. 0. 0. 0. 0. 0. 0. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1.]]

### 1.3.5 Задание

In [18]:
arr = np.random.random((15))
print(-np.sort(-arr))

[0.98017201 0.97020081 0.86680545 0.74448402 0.66121481 0.58553634
 0.53271491 0.48751777 0.47241112 0.42586154 0.32768832 0.2067239
 0.15913011 0.07208984 0.00670139]

### 1.3.6 Задание

In [19]:
arr = np.arange(36).reshape(6, 6)
print (arr.shape, arr.ndim, arr.size)

(6, 6) 2 36

### 2.3.1 Задание

In [20]:
import pandas as pd

ser = pd.Series({'a': 1.868, 'b': -20.843, 'c': 3})

print((ser[0] - ser[1])**2)

515.7895209999999

### 2.3.2 Задание

In [21]:
df = pd.read_csv("https://raw.githubusercontent.com/akmand/datasets/main/adult.csv")
df.head()

,age,workclass,education_num,marital_status,occupation,relationship,race,gender,hours_per_week,native_country,capital,income_status
0,39,State-gov,13,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,2174,<=50K
1,50,Self-emp-not-inc,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,0,<=50K
2,38,Private,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,0,<=50K
3,53,Private,7,Married-civ-spouse,Handlers-cleaners,Husband,Other,Male,40,United-States,0,<=50K
4,28,Private,13,Married-civ-spouse,Prof-specialty,Wife,Other,Female,40,Other,0,<=50K

### 2.3.3 Задание

In [22]:
df.head(2)
df.tail(3)
df.shape
df.describe

<bound method NDFrame.describe of        age         workclass  education_num      marital_status  \
0       39         State-gov             13       Never-married
1       50  Self-emp-not-inc             13  Married-civ-spouse
2       38           Private              9            Divorced
3       53           Private              7  Married-civ-spouse
4       28           Private             13  Married-civ-spouse
...    ...               ...            ...                 ...
45217   33           Private             13       Never-married
45218   39           Private             13            Divorced
45219   38           Private             13  Married-civ-spouse
45220   44           Private             13            Divorced
45221   35      Self-emp-inc             13  Married-civ-spouse

              occupation   relationship   race  gender  hours_per_week  \
0           Adm-clerical  Not-in-family  White    Male              40
1        Exec-managerial        Husband  White    Male              13
2      Handlers-cleaners  Not-in-family  White    Male              40
3      Handlers-cleaners        Husband  Other    Male              40
4         Prof-specialty           Wife  Other  Female              40
...                  ...            ...    ...     ...             ...
45217     Prof-specialty      Own-child  White    Male              40
45218     Prof-specialty  Not-in-family  White  Female              36
45219     Prof-specialty        Husband  White    Male              50
45220       Adm-clerical      Own-child  Other    Male              40
45221    Exec-managerial        Husband  White    Male              60

      native_country  capital income_status
0      United-States     2174         <=50K
1      United-States        0         <=50K
2      United-States        0         <=50K
3      United-States        0         <=50K
4              Other        0         <=50K
...              ...      ...           ...
45217  United-States        0         <=50K
45218  United-States        0         <=50K
45219  United-States        0         <=50K
45220  United-States     5455         <=50K
45221  United-States        0          >50K

[45222 rows x 12 columns]>

In [23]:
df.iloc[1:4]

,age,workclass,education_num,marital_status,occupation,relationship,race,gender,hours_per_week,native_country,capital,income_status
1,50,Self-emp-not-inc,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,0,<=50K
2,38,Private,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,0,<=50K
3,53,Private,7,Married-civ-spouse,Handlers-cleaners,Husband,Other,Male,40,United-States,0,<=50K

In [24]:
df[df['marital_status'] == 'Divorced'].head(2)

,age,workclass,education_num,marital_status,occupation,relationship,race,gender,hours_per_week,native_country,capital,income_status
2,38,Private,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,0,<=50K
18,43,Self-emp-not-inc,14,Divorced,Exec-managerial,Unmarried,White,Female,45,United-States,0,>50K

### 3.3.2 Задание

In [25]:
df = pd.read_csv('https://raw.githubusercontent.com/akmand/datasets/master/iris.csv')
df.head()

   sepal_length_cm  sepal_width_cm  petal_length_cm  petal_width_cm species
0              5.1             3.5              1.4             0.2  setosa
1              4.9             3.0              1.4             0.2  setosa
2              4.7             3.2              1.3             0.2  setosa
3              4.6             3.1              1.5             0.2  setosa
4              5.0             3.6              1.4             0.2  setosa

нормализацию первого числового признака (sepal_length_cm) с использованием минимаксного преобразования, а второго (sepal_width_cm) с задействованием z-масштабирования

In [26]:
from sklearn import preprocessing

feat_length = np.array(df['sepal_length_cm']) 
feat_width = np.array(df['sepal_width_cm'])

minmax_scale = preprocessing.MinMaxScaler(feature_range = (0, 1))
z_scale = preprocessing.StandardScaler()

scaled_feat_length = minmax_scale.fit_transform(feat_length.reshape(-1, 1))
scaled_feat_width = z_scale.fit_transform(feat_width.reshape(-1, 1))

print(scaled_feat_length[0:5], '\n'*2, scaled_feat_width[0:5])

[[0.22222222]
 [0.16666667]
 [0.11111111]
 [0.08333333]
 [0.19444444]]

 [[ 1.03205722]
 [-0.1249576 ]
 [ 0.33784833]
 [ 0.10644536]
 [ 1.26346019]]